GCSE/Computing_Fundamentals/pages/3-1-10-Questions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Data Representation Questions</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">Data Representation Questions</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Past Papers</a>
<ul>
<li><a href="#sec-1-1">OCR Past Papers filtered for AQA spec</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Data Representation, exam style questions</a>
<ul>
<li><a href="#sec-2-1">Binary to Denary Conversions</a></li>
<li><a href="#sec-2-2">Denary to Binary Conversions</a></li>
<li><a href="#sec-2-3">Hexadecimal to Denary Conversions</a></li>
<li><a href="#sec-2-4">Denary to Hexadecimal Conversions</a></li>
<li><a href="#sec-2-5">Binary and character encoding</a></li>
<li><a href="#sec-2-6">Sound and image representation</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class=ribbon>
<a href="GITHUB URL HERE">Fork me on GitHub</a>
</div>

<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1"><span class="section-number-2">1</span> Past Papers</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 try">
<h3 id="sec-1-1">OCR Past Papers filtered for AQA spec</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Kindly created by Nicola Mounsey and available on the CAS website <a href="http://community.computingatschool.org.uk/resources/2244">here</a>
</li>
<li><a href="doc/papers2014.pdf">Download the PDF Here</a>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2 activity">
<h2 id="sec-2"><span class="section-number-2">2</span> Data Representation, exam style questions</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-sec-2-1" class="outline-3 try">
<h3 id="sec-2-1">Binary to Denary Conversions</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>State the denary representation of the binary number <code>10100101</code> (1)
</li>
<li>State the denary representation of the binary number <code>00101111</code> (1)
</li>
<li>State the denary representation of the binary number <code>11100011</code> (1)
</li>
<li>State the denary representation of the binary number <code>11110001</code> (1)
</li>
<li>State the denary representation of the binary number <code>10101101</code> (1)
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3 try">
<h3 id="sec-2-2">Denary to Binary Conversions</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>State the binary representation of the denary number <code>42</code> (1)
</li>
<li>State the binary representation of the denary number <code>97</code> (1)
</li>
<li>State the binary representation of the denary number <code>128</code> (1)
</li>
<li>State the binary representation of the denary number <code>200</code> (1)
</li>
<li>State the binary representation of the denary number <code>247</code> (1)
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3 try">
<h3 id="sec-2-3">Hexadecimal to Denary Conversions</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li>State the denary representation of the hexadecimal number <code>42</code> (2)
</li>
<li>State the denary representation of the hexadecimal number <code>A9</code> (2)
</li>
<li>State the denary representation of the hexadecimal number <code>8F</code> (2)
</li>
<li>State the denary representation of the hexadecimal number <code>AF</code> (2)
</li>
<li>State the denary representation of the hexadecimal number <code>CC</code> (2)
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3 try">
<h3 id="sec-2-4">Denary to Hexadecimal Conversions</h3>
<div class="outline-text-3" id="text-2-4">
<ol class="org-ol">
<li>State the hex representation of the denary number <code>42</code> (2)
</li>
<li>State the hex representation of the denary number <code>97</code> (2)
</li>
<li>State the hex representation of the denary number <code>122</code> (2)
</li>
<li>State the hex representation of the denary number <code>201</code> (2)
</li>
<li>State the hex representation of the denary number <code>248</code> (2)
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-2-5" class="outline-3 try">
<h3 id="sec-2-5">Binary and character encoding</h3>
<div class="outline-text-3" id="text-2-5">
<ol class="org-ol">
<li>Give one reason why we use binary to represent data in computers (1)
</li>
<li>Give one reason why programmers often use hexadecimal, instead of binary, to represent numbers. (1)
</li>
<li>The UTF-8 character encoding scheme can use up to 6 bytes to encode each character. How many bits is this? (1)
</li>
<li>What is the total number of characters that could be encoded under the UTF-8 standard? (1)
</li>
<li>Give one advantage and one disadvantage the UTF-8 character encoding scheme has over the ASCII character encoding scheme. (2)
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-2-6" class="outline-3 try">
<h3 id="sec-2-6">Sound and image representation</h3>
<div class="outline-text-3" id="text-2-6">
<ol class="org-ol">
<li>Describe how a 1 minute analogue recording of a musician playing an instrument, could be represented in binary. (3)
</li>
<li>Describe how a full colour document could be represented in binary when it is scanned. (3)
</li>
<li>What is meant by the term compression? (1)
</li>
<li>What is the difference between lossy and lossless compression? (2)
</li>
<li>Give one advantage and one disadvantage of lossy compression formats. (2)
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
